<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-dev-deploy","backend_type":"remote","backend":"0dd52039d936a7e1d5025a8a4d08a2edb19c1f8a40406c06dd09dde4084f97a6","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #103 at https://github.com/scidsg/hushline/actions/runs/9884996721","plan_out_hash":"9acc928b603efa9e97c9f7f87f1ef5d33c6123175f14023aa02989a5e6276e93","plan_hash":"b836b0611987d1842a3aeaee7d1930ab0828c39bd6ca46e7920f01636ee0e022","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-dev-deploy__ workspace<details open><summary>With variables</summary>

```hcl
branch = "dev-deploy"
name   = "hushline-dev-dev-deploy"
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_project.hush_line_dev will be created
+   resource "digitalocean_project" "hush_line_dev" {
+       created_at  = (known after apply)
+       description = "Development instance based on the dev-deploy branch"
+       environment = "Development"
+       id          = (known after apply)
+       is_default  = false
+       name        = "hushline-dev-dev-deploy"
+       owner_id    = (known after apply)
+       owner_uuid  = (known after apply)
+       purpose     = "Web Application"
+       resources   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = (known after apply)
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains = (known after apply)
+           name    = "hushline-dev-dev-deploy"
+           region  = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               dockerfile_path    = "Dockerfile"
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "hushline"
+               run_command        = (known after apply)

+               github {
+                   branch         = "dev-deploy"
+                   deploy_on_push = true
+                   repo           = "scidsg/hushline"
                }

+               health_check {
+                   http_path = "/health.json"
                }

+               routes (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #103](https://github.com/scidsg/hushline/actions/runs/9884996721)